DataProcessors/_ЭкспортСчетФактур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>_ЭкспортСчетФактур</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыВзаиморасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыВзаиморасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безнал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Терминал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РеализацияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>РеализацияТМЦ</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказАгента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.Доходы</xr:Item>
				<xr:Item>AccumulationRegister.СальдоПоТаре</xr:Item>
				<xr:Item>AccumulationRegister.Сальдо</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccumulationRegister.Бонусы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладНакопления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Округление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомашина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказАгента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отгрузка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПосле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНаценкой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНаценкой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дисконт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОтпускная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОтпускная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/_ЭкспортСчетФактур/Ext/ObjectModule.bsl
Процедура Заполнить(СписокДокументов, Период, Организация) Экспорт
	СписокДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,
	|	Ссылка.Дата
	|ИЗ
	|	Документ.РеализацияТМЦ
	|ГДЕ
	|	Ссылка.Проведен = Истина
	|	И Ссылка.ВидРеализации.ТипВзаиморасчета = ЗНАЧЕНИЕ(Перечисление.ТипыВзаиморасчета.Безнал)
	|	И Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Ссылка.Организация = &Организация
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка.Дата";
	
	Результат = Запрос.Выполнить();
	ВыборкаДокумент = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой); 
	Пока ВыборкаДокумент.Следующий() Цикл
		Строка = СписокДокументов.Добавить();
		Строка.Экспортировать = Истина;
		Строка.Документ = ВыборкаДокумент.Ссылка;
		Строка.Контрагент = ВыборкаДокумент.Ссылка.Контрагент;
		Строка.Сумма = ВыборкаДокумент.Ссылка.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура Сформировать(ТабДок, СписокДокументов) Экспорт
	СписокДокументовНаЭкспорт = СписокДокументов.НайтиСтроки(Новый Структура("Экспортировать", Истина));
	Если СписокДокументовНаЭкспорт.Количество() = 0 Тогда
		Сообщить("Не отмечен ни один документ на экспорт!");
	КонецЕсли;
	
	Индекс = 0;
	
	// Настройка макета
	Макет = ПолучитьМакет("Основной");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьДокумент = Макет.ПолучитьОбласть("Документ");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьОкругление = Макет.ПолучитьОбласть("Округление");
	
	// Шапка
	ТабДок.Вывести(ОбластьЗаголовок);
	
	// Строки
	Для Каждого СтрокаИзСпискаДокументов из СписокДокументовНаЭкспорт Цикл
		Выборка = СтрокаИзСпискаДокументов.Документ;
		Индекс = Индекс + 1;

		Для Каждого Строка Из Выборка.Товары Цикл
			УчетнаяПолитика = УчетныеПолитики.ПолучитьНаДату(Выборка.Дата, Выборка.Организация);
			
			Если Строка.НомерСтроки = 1 Тогда
				Область = ОбластьДокумент;
				
				Область.Параметры.Заполнить(Выборка);
				Область.Параметры.Индекс = Индекс;
				Область.Параметры.НомерДоговора = Выборка.Договор.Номер;
				Область.Параметры.ДатаДоговора = Выборка.Договор.Дата;
				Область.Параметры.НомерДоверенности = Выборка.НомерДоверенности;
				Область.Параметры.ДатаДоверенности = Выборка.ДатаДоверенности;
				Область.Параметры.МОЛ = Выборка.Склад.МОЛ;
				
				Область.Параметры.НаименованиеОрганизации = Выборка.Организация.Наименование;
				Область.Параметры.ИННОрганизации = Выборка.Организация.ИНН;
				Область.Параметры.СчетОрганизации = Выборка.Организация.ОсновнойБанковскийСчет.Номер;
				Область.Параметры.МФООрганизации = Выборка.Организация.ОсновнойБанковскийСчет.Банк.Код;
				Область.Параметры.АдресОрганизации = Выборка.Организация.Адрес;
				Область.Параметры.ТелефонОрганизации = Выборка.Организация.Телефон;
				Область.Параметры.ОКЭДОрганизации = Выборка.Организация.КодОКЭД;
				Область.Параметры.КодРайонаОрганизации = Выборка.Организация.Район.Код;
				Область.Параметры.ДиректорОрганизации = УчетнаяПолитика.Руководитель;
				Область.Параметры.БухгалтерОрганизации = УчетнаяПолитика.Бухгалтер;
				Область.Параметры.КодПНДСОрганизации = Выборка.Организация.КодПНДС;
				
				Область.Параметры.НаименованиеКонтрагента = Выборка.Контрагент.Наименование;
				Область.Параметры.ИННКонтрагента = Выборка.Контрагент.ИНН;
				Область.Параметры.СчетКонтрагента = Выборка.Контрагент.ОсновнойБанковскийСчет.Номер;
				Область.Параметры.МФОКонтрагента = Выборка.Контрагент.ОсновнойБанковскийСчет.Банк.Код;
				Область.Параметры.АдресКонтрагента = Выборка.Контрагент.Адрес;
				Область.Параметры.ТелефонКонтрагента = Выборка.Контрагент.Телефон;
				Область.Параметры.ОКЭДКонтрагента = Выборка.Контрагент.КодОКЭД;
				Область.Параметры.КодРайонаКонтрагента = Выборка.Контрагент.Район.Код;
				Область.Параметры.ДиректорКонтрагента = Выборка.Контрагент.Руководитель;
				Область.Параметры.БухгалтерКонтрагента = Выборка.Контрагент.Бухгалтер;
				Область.Параметры.КодПНДСКонтрагента = Выборка.Контрагент.КодПНДС;
			ИначеЕсли Строка.НомерСтроки > 1 Тогда
				Область = ОбластьСтрока;
			КонецЕсли;
			
			Область.Параметры.НомерСтроки = Строка.НомерСтроки;
			Область.Параметры.Товар = Строка.Товар.Наименование;
			Область.Параметры.КодИКПУ = ?(ЗначениеЗаполнено(Строка.Товар.КодИКПУ), Строка.Товар.КодИКПУ, Строка.Товар.ВидТовара.КодИКПУ);
			Область.Параметры.ШтрихКод = Строка.Товар.ШтрихКод;
			Область.Параметры.ЕдиницаИзмерения = Строка.Товар.ЕдиницаИзмерения.Код;
			Область.Параметры.Количество = Строка.Количество;
			Область.Параметры.ЦенаБазовая = Строка.ЦенаБазовая;
			Область.Параметры.Наценка = АрифметическиеФункции.ОпределитьНаценку(Строка.ЦенаСНаценкой, Строка.ЦенаБазовая);
			Область.Параметры.ЦенаСНаценкой = Строка.ЦенаСНаценкой;
			Область.Параметры.СуммаСНаценкой = Строка.СуммаСНаценкой;
			Область.Параметры.СтавкаНДС = Строка.СтавкаНДС.Ставка;
			Область.Параметры.СуммаНДС = Строка.СуммаНДС;
			Область.Параметры.СуммаПродажная = Строка.СуммаПродажная;
			
			ТабДок.Вывести(Область);
		КонецЦикла;

		Если Выборка.Округление <> 0 Тогда
			ОбластьОкругление.Параметры.НомерСтроки = Строка.НомерСтроки + 1;
			ОбластьОкругление.Параметры.КодИКПУ = ?(Выборка.Округление > 0, Справочники.ВидыТовара.НакладныеРасходы.КодИКПУ, Справочники.ВидыТовара.ФинансоваяСкидка.КодИКПУ);
			ОбластьОкругление.Параметры.ЦенаБазовая = АрифметическиеФункции.ВычитатьНаценку(Выборка.Округление, УчетнаяПолитика.СтавкаНДС.Ставка);
			ОбластьОкругление.Параметры.ЦенаСНаценкой = АрифметическиеФункции.ВычитатьНаценку(Выборка.Округление, УчетнаяПолитика.СтавкаНДС.Ставка);
			ОбластьОкругление.Параметры.СуммаСНаценкой = АрифметическиеФункции.ВычитатьНаценку(Выборка.Округление, УчетнаяПолитика.СтавкаНДС.Ставка);
			ОбластьОкругление.Параметры.СтавкаНДС = УчетнаяПолитика.СтавкаНДС.Ставка;
			ОбластьОкругление.Параметры.СуммаНДС = АрифметическиеФункции.ВыделитьНаценку(Выборка.Округление, УчетнаяПолитика.СтавкаНДС.Ставка);
			ОбластьОкругление.Параметры.СуммаПродажная = Выборка.Округление;
			ТабДок.Вывести(ОбластьОкругление);
		КонецЕсли;
	КонецЦикла;
	
	// Вывод заполненной формы
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры
